ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.3.5" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_3_5.xsd">
  <cpu>
    <name>CM4</name>
    <displayName>Cortex-M4 (with FPU)</displayName>
    <groups>
      <group>
        <name>Core</name>
        <description>All CPU Registers</description>
        <size>32</size>
        <access>RW</access>
        <type>unsigned int</type>
        <registers>
          <register>
            <name>R0</name>
            <description>General purpose register 0</description>
            <Index>0</Index>
          </register>
          <register>
            <name>R1</name>
            <description>General purpose register 1</description>
            <Index>1</Index>
          </register>
          <register>
            <name>R2</name>
            <description>General purpose register 2</description>
            <Index>2</Index>
          </register>
          <register>
            <name>R3</name>
            <description>General purpose register 3</description>
            <Index>3</Index>
          </register>
          <register>
            <name>R4</name>
            <description>General purpose register 4</description>
            <Index>4</Index>
          </register>
          <register>
            <name>R5</name>
            <description>General purpose register 5</description>
            <Index>5</Index>
          </register>
          <register>
            <name>R6</name>
            <description>General purpose register 6</description>
            <Index>6</Index>
          </register>
          <register>
            <name>R7</name>
            <description>General purpose register 7</description>
            <Index>7</Index>
          </register>
          <register>
            <name>R8</name>
            <description>General purpose register 8</description>
            <Index>8</Index>
          </register>
          <register>
            <name>R9</name>
            <description>General purpose register 9</description>
            <Index>9</Index>
          </register>
          <register>
            <name>R10</name>
            <description>General purpose register 10</description>
            <Index>10</Index>
          </register>
          <register>
            <name>R11</name>
            <description>General purpose register 11</description>
            <Index>11</Index>
          </register>
          <register>
            <name>R12</name>
            <description>General purpose register 12</description>
            <Index>12</Index>
          </register>
          <register>
            <name>R13</name>
            <AliasName>SP</AliasName>
            <displayName>R13 (SP)</displayName>
            <description>Stack pointer</description>
            <Index>13</Index>
          </register>
          <register>
            <name>R14</name>
            <AliasName>LR</AliasName>
            <displayName>R14 (LR)</displayName>
            <description>Link register</description>
            <Index>14</Index>
          </register>
          <register>
            <name>R15</name>
            <AliasName>PC</AliasName>
            <displayName>R15 (PC)</displayName>
            <description>Program counter</description>
            <Index>15</Index>
          </register>
          <register>
            <name>xPSR</name>
            <description>Program status register</description>
            <Index>16</Index>
            <fields>
              <field>
                <name>N</name>
                <description>Negative flag</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>Z</name>
                <description>Zero flag</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>C</name>
                <description>Carry flag</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>V</name>
                <description>Overflow flag</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>Q</name>
                <description>DSP overflow and saturation flag</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>T</name>
                <description>Thumb state bit</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ICI/IT HighBits</name>
                <description>Interruptible-continuable instruction bits (high bits)</description>
                <bitOffset>25</bitOffset>
                <bitWidth>2</bitWidth>
              </field>
              <field>
                <name>ICI/IT LowBits</name>
                <description>Interruptible-continuable instruction bits (low bits)</description>
                <bitOffset>10</bitOffset>
                <bitWidth>6</bitWidth>
              </field>
              <field>
                <name>ISR Number</name>
                <description>Interrupt service routine number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>MSP</name>
            <description>Main stack pointer</description>
            <Index>17</Index>
          </register>
          <register>
            <name>PSP</name>
            <description>Process stack pointer</description>
            <Index>18</Index>
          </register>
          <register>
            <name>APSR</name>
            <description>Application program status register</description>
            <Index>21</Index>
            <fields>
              <field>
                <name>N</name>
                <description>Negative flag</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>Z</name>
                <description>Zero flag</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>C</name>
                <description>Carry flag</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>V</name>
                <description>Overflow flag</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>Q</name>
                <description>DSP overflow and saturation flag</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>EPSR</name>
            <description>Exception program status register</description>
            <Index>22</Index>
            <fields>
              <field>
                <name>ICI/IT HighBits</name>
                <description>Interruptible-continuable instruction bits (high bits)</description>
                <bitOffset>25</bitOffset>
                <bitWidth>2</bitWidth>
              </field>
              <field>
                <name>ICI/IT LowBits</name>
                <description>Interruptible-continuable instruction bits (low bits)</description>
                <bitOffset>10</bitOffset>
                <bitWidth>6</bitWidth>
              </field>
              <field>
                <name>T</name>
                <description>Thumb state bit</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>IPSR</name>
            <description>Interrupt program status register</description>
            <Index>23</Index>
            <fields>
              <field>
                <name>ISR Number</name>
                <description>Interrupt service routine number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>PriMask</name>
            <description>Priority mask register</description>
            <Index>24</Index>
            <fields>
              <field>
                <name>PriMask</name>
                <description>Prevent the activation of all exceptions with configurable priority</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>BasePri</name>
            <description>Base priority mask register</description>
            <Index>25</Index>
            <fields>
              <field>
                <name>BasePri</name>
                <description>Priority mask bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>FaultMask</name>
            <description>Fault mask register</description>
            <Index>26</Index>
            <fields>
              <field>
                <name>FaultMask</name>
                <description>Prevent the activation of all exceptions except for NMI</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>Control</name>
            <description>Control register</description>
            <Index>27</Index>
            <fields>
              <field>
                <name>FPCA</name>
                <description>Context floating-point active</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SPSEL</name>
                <description>Active stack pointer</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>nPRIV</name>
                <description>Thread mode privilege level</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CycleCount</name>
            <description>Cycle count</description>
            <Index>65</Index>
          </register>
