ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
        </registers>
      </group>
      <group>
        <name>Peripherals</name>
        <description>Memory-Mapped CPU Registers</description>
        <size>32</size>
        <access>RW</access>
        <type>unsigned int</type>
        <peripherals>
          <peripheral>
            <name>ITM</name>
            <description>Instrumentation Macrocell</description>
            <groupName></groupName>
            <baseAddress>0xE0000000</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x1000</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Stimulus Port Register %s</name>
                <displayName>ITM_STIM_%s</displayName>
                <description>Provides the interface for generating instrumentation messages</description>
                <addressOffset>0x0</addressOffset>
                <dim>256</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>STIMULUS</name>
                    <description>Data write to the stimulus port FIFO, for forwarding as a software event packet</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                  <field>
                    <name>FIFOREADY</name>
                    <description>Indicates whether the stimulus port FIFO can accept data</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Stimulus port FIFO full</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Stimulus port FIFO can accept at least one word</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Trace Enable Register %s</name>
                <displayName>ITM_TER_%s</displayName>
                <description>Provide an individual enable bit for each ITM_STIM register</description>
                <addressOffset>0xE00</addressOffset>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>STIMENA</name>
                    <description>For bit STIMENA[n], in register ITM_TERx</description>
                    <bitRange>[31:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Stimulus port (32x + n) disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Stimulus port (32x + n) enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Trace Privilege Register</name>
                <displayName>ITM_TPR</displayName>
                <description>Controls which stimulus ports can be accessed by unprivileged code</description>
                <addressOffset>0xE40</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRIVMASK</name>
                    <description>Bit mask to enable unprivileged access to ITM stimulus ports</description>
                    <bitRange>[31:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Unprivileged access permitted</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Privileged access only</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Trace Control Register</name>
                <displayName>ITM_TCR</displayName>
                <description>Configures and controls transfers through the ITM interface</description>
                <addressOffset>0xE80</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>BUSY</name>
                    <description>Indicates whether the ITM is currently processing events</description>
                    <bitRange>[23:23]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>ITM is not processing any events</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ITM events present and being drained</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TraceBusID</name>
                    <description>Identifier for multi-source trace stream formatting</description>
                    <bitRange>[22:16]</bitRange>
                  </field>
                  <field>
                    <name>GTSFREQ</name>
                    <description>Global timestamp frequency</description>
                    <bitRange>[11:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disable generation of global timestamps</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Generate timestamp request whenever the ITM detects a change in global timestamp counter bits[47:7]</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Generate timestamp request whenever the ITM detects a change in global timestamp counter bits[47:13]</description>
                        <value>10</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Generate a timestamp after every packet, if the output FIFO is empty</description>
                        <value>11</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TSPrescale</name>
                    <description>Local timestamp prescaler, used with the trace packet reference clock</description>
                    <bitRange>[9:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No prescaling</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Divide by 4</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Divide by 16</description>
                        <value>10</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Divide by 64</description>
                        <value>11</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SWOENA</name>
                    <description>Enables asynchronous clocking of the timestamp counter</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Timestamp counter uses the processor system clock</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Timestamp counter uses asynchronous clock from the TPIU interface</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TXENA</name>
                    <description>Enables forwarding of hardware event packet from the DWT unit to the ITM for output to the TPIU</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SYNCENA</name>
                    <description>Enables Synchronization packet transmission for a synchronous TPIU</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TSENA</name>
                    <description>Enables Local timestamp generation</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ITMENA</name>
                    <description>Enables the ITM</description>
                    <bitRange>[0:0]</bitRange>
                  </field>
                </fields>
              </register>
