ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>DWT</name>
            <description>Data Watchpoint and Trace</description>
            <groupName></groupName>
            <baseAddress>0xE0001000</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x1000</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Control register</name>
                <displayName>DWT_CTRL</displayName>
                <description>Provides configuration and status information for the DWT unit, and used to control features of the unit</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>NUMCOMP</name>
                    <description>Number of comparators implemented</description>
                    <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                    <name>NOTRCPKT</name>
                    <description>Shows whether the implementation supports trace sampling and exception tracing</description>
                    <bitRange>[27:27]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Trace sampling and exception tracing supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Trace sampling and exception tracing not supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NOEXTTRIG</name>
                    <description>Shows whether the implementation includes external match signals, CMPMATCH[N]</description>
                    <bitRange>[26:26]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>CMPMATCH[N] supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>CMPMATCH[N] not supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NOCYCCNT</name>
                    <description>Shows whether the implementation supports a cycle counter</description>
                    <bitRange>[25:25]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Cycle counter supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Cycle counter not supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NOPRFCNT</name>
                    <description>Shows whether the implementation supports the profiling counters</description>
                    <bitRange>[24:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CYCEVTENA</name>
                    <description>Enables POSTCNT underflow Event counter packets generation</description>
                    <bitRange>[22:22]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No POSTCNT underflow packets generated</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>POSTCNT underflow packets generated, if PCSAMPLENA set to 0</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FOLDEVTENA</name>
                    <description>Enables generation of the Folded-instruction counter overflow event</description>
                    <bitRange>[21:21]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LSUEVTENA</name>
                    <description>Enables generation of the LSU counter overflow event</description>
                    <bitRange>[20:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SLEEPEVTENA</name>
                    <description>Enables generation of the Sleep counter overflow event</description>
                    <bitRange>[19:19]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>EXCEVTENA</name>
                    <description>Enables generation of the Exception overhead counter overflow event</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CPIEVTENA</name>
                    <description>Enables generation of the CPI counter overflow event</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>EXCTRCENA</name>
                    <description>Enables generation of exception trace</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PCSAMPLENA</name>
                    <description>Enables use of POSTCNT counter as a timer for Periodic PC sample packet generation</description>
                    <bitRange>[12:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No Periodic PC sample packets generated</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Periodic PC sample packets generated</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SYNCTAP</name>
                    <description>Selects the position of the synchronization packet counter tap on the CYCCNT counter</description>
                    <bitRange>[11:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled. No Synchronization packets</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Synchronization counter tap at CYCCNT[26]</description>
                        <value>10</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Synchronization counter tap at CYCCNT[28]</description>
                        <value>11</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CYCTAP</name>
                    <description>Selects the position of the POSTCNT tap on the CYCCNT counter</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>POSTCNT tap at CYCCNT[6]</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>POSTCNT tap at CYCCNT[10]</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>POSTINIT</name>
                    <description>Initial value for the POSTCNT counter</description>
                    <bitRange>[8:5]</bitRange>
                  </field>
                  <field>
                    <name>POSTPRESET</name>
                    <description>Reload value for the POSTCNT counter</description>
                    <bitRange>[4:1]</bitRange>
                  </field>
                  <field>
                    <name>CYCCNTENA</name>
                    <description>Enables CYCCNT</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Cycle Count register</name>
                <displayName>DWT_CYCCNT</displayName>
                <description>Shows or sets the value of the processor cycle counter, CYCCNT</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CYCCNT</name>
                    <description>Incrementing cycle counter value</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>CPI Count register</name>
                <displayName>DWT_CPICNT</displayName>
                <description>Counts additional cycles required to execute multi-cycle instructions and instruction fetch stalls</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CPICNT</name>
                    <description>Base instruction overhead counter</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Exception Overhead Count register</name>
                <displayName>DWT_EXCCNT</displayName>
                <description>Counts the total cycles spent in exception processing</description>
                <addressOffset>0xC</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>EXCCNT</name>
                    <description>The exception overhead counter</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Sleep Count register</name>
                <displayName>DWT_SLEEPCNT</displayName>
                <description>Counts the total number of cycles that the processor is sleeping</description>
                <addressOffset>0x10</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>SLEEPCNT</name>
                    <description>Sleep counter</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>LSU Count register</name>
                <displayName>DWT_LSUCNT</displayName>
                <description>Increments on the additional cycles required to execute all load or store instructions</description>
                <addressOffset>0x14</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>LSUCNT</name>
                    <description>Load-store overhead counter</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Folded-instruction Count register</name>
                <displayName>DWT_FOLDCNT</displayName>
                <description>Increments on each instruction that takes 0 cycles</description>
                <addressOffset>0x18</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>FOLDCNT</name>
                    <description>Folded instruction counter</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Program Counter Sample Register</name>
                <displayName>DWT_PCSR</displayName>
                <description>Samples the current value of the program counter</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>EIASAMPLE</name>
                    <description>Executed Instruction Address sample value</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Comparator register</name>
                <displayName>DWT_COMP_%s</displayName>
                <description>Provides a reference value for use by comparator n</description>
                <addressOffset>0x20</addressOffset>
                <access>read-write</access>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <fields>
                  <field>
                    <name>COMP</name>
                    <description>Reference value for comparison</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Comparator Mask Register %s</name>
                <displayName>DWT_MASK_%s</displayName>
                <description>Provides the size of the ignore mask applied to the access address for address range matching by comparator n</description>
                <addressOffset>0x24</addressOffset>
                <access>read-write</access>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <fields>
                  <field>
                    <name>MASK</name>
                    <description>The size of the ignore mask, 0-31 bits, applied to address range matching</description>
                    <bitRange>[4:0]</bitRange>
                  </field>
                </fields>
              </register>
