ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>Comparator Function Register %s</name>
                <displayName>DWT_FUNCTION_%s</displayName>
                <description>Controls the operation of comparator n</description>
                <addressOffset>0x28</addressOffset>
                <access>read-write</access>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <fields>
                  <field>
                    <name>MATCHED</name>
                    <description>Comparator match</description>
                    <bitRange>[24:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No match</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Match</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DATAVADDR1</name>
                    <description>When the DATAVMATCH and LNK1ENA bits are both 1, this field can hold the comparator number of a second comparator to use for linked address comparison</description>
                    <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                    <name>DATAVADDR0</name>
                    <description>When the DATAVMATCH bit is set to 1 this field can hold the comparator number of a comparator to use for linked address comparison</description>
                    <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                    <name>DATAVSIZE</name>
                    <description>For data value matching, specifies the size of the required data comparison</description>
                    <bitRange>[11:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Byte</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halfword</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Word</description>
                        <value>10</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LNK1ENA</name>
                    <description>Indicates whether the implementation supports use of a second linked comparator</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Second linked comparator not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Second linked comparator supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DATAVMATCH</name>
                    <description>Enables data value comparison, if supported</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Perform address comparison</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Perform data value comparison</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CYCMATCH</name>
                    <description>DWT_FUNCTION0 only</description>
                    <bitRange>[7:7]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No comparison is performed</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Compare DWT_COMP0 with the cycle counter, DWT_CYCCNT</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>EMITRANGE</name>
                    <description>If the implementation supports trace sampling, enables generation of Data trace address packets, that hold Daddr[15</description>
                    <bitRange>[5:5]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Data trace address packets disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enable Data trace address packet generation</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FUNCTION</name>
                    <description>Selects action taken on comparator match</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>= Disabled or LinkAddr()</description>
                        <value>0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
