ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>DPB</name>
            <description>Flash Patch and Breakpoint</description>
            <groupName></groupName>
            <baseAddress>0xE0002000</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x1000</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>FlashPatch Control Register</name>
                <displayName>FP_CTRL</displayName>
                <description>Provides FPB implementation information, and the global enable for the FPB unit</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>REV</name>
                    <description>Flash Patch Breakpoint architecture revision</description>
                    <bitRange>[31:28]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Flash Patch Breakpoint version 1</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Flash Patch Breakpoint version 2</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NUM_CODE[6:4]</name>
                    <description>Number of comperators 6:4</description>
                    <bitRange>[14:12]</bitRange>
                  </field>
                  <field>
                    <name>NUM_LIT</name>
                    <description>The number of literal address comparators supported, starting from NUM_CODE upwards</description>
                    <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                    <name>NUM_CODE[3:0]</name>
                    <description>Number of comperators 3:0</description>
                    <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                    <name>KEY</name>
                    <description>On any write to FP_CTRL, this bit must be 1</description>
                    <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                    <name>ENABLE</name>
                    <description>Enable bit for the FPB</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Flash Patch Breakpoint disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Flash Patch Breakpoint enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>FlashPatch Remap register</name>
                <displayName>FP_REMAP</displayName>
                <description>Indicates whether the implementation supports flash patch remap, and if it does, holds the SRAM address for remap</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>RMPSPT</name>
                    <description>Indicates whether the FPB unit supports flash patch remap</description>
                    <bitRange>[29:29]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Remapping not supported. The FPB only supports breakpoint functionality</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Hard-wired remap to SRAM region</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>REMAP</name>
                    <description>If the FPB supports flash patch remap, this field</description>
                    <bitRange>[28:5]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>FlashPatch Comparator Register %s</name>
                <displayName>FP_COMP_%s</displayName>
                <description>Holds an address for comparison with addresses in the Code memory region</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <dim>8</dim>
                <dimIncrement>4</dimIncrement>
                <fields>
                  <field>
                    <name>REPLACE</name>
                    <description>For an instruction address comparator</description>
                    <bitRange>[31:30]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Remap to remap address</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Breakpoint on instruction at '000':COMP:'00'</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Breakpoint on instruction at '000':COMP:'10'</description>
                        <value>10</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Breakpoint on both instructions at '000':COMP:'00' and '000':COMP:'10'</description>
                        <value>11</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>COMP</name>
                    <description>Bits[28</description>
                    <bitRange>[28:2]</bitRange>
                  </field>
                  <field>
                    <name>For a literal address or instruction address remap</name>
                    <description>of the comparison are also zero</description>
                    <bitRange>[1:0]</bitRange>
                  </field>
                  <field>
                    <name>For an instruction address breakpoint</name>
                    <description>of the comparison are encoded by the REPLACE field</description>
                    <bitRange>[1:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>30 29 28 2 1 0 COMP Reserved REPLACE Reserved ENABLE C1 ARMv7-M Debug C1</description>
                        <value>31</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE</name>
                    <description>Enable bit for this comparator</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Comparator disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Comparator enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BPADDR</name>
                    <description>Breakpoint address</description>
                    <bitRange>[31:1]</bitRange>
                  </field>
                  <field>
                    <name>BE</name>
                    <description>Enable bit for Breakpoint</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Breakpoint disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Breakpoint enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DCBA</name>
                    <description>This field is defined depending on the value for Breakpoint Enabled</description>
                    <bitRange>[31:1]</bitRange>
                  </field>
                  <field>
                    <name>BPADDR</name>
                    <description>Breakpoint address</description>
                    <bitRange>[31:1]</bitRange>
                  </field>
                  <field>
                    <name>FE</name>
                    <description>Specifies if Flash Patch enabled</description>
                    <bitRange>[31:31]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Flash Patch disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Flash Patch enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FPADDR</name>
                    <description>Specifies bits[28</description>
                    <bitRange>[28:2]</bitRange>
                  </field>
                  <field>
                    <name>BE</name>
                    <description>Breakpoint Enabled bit</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Breakpoint disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Breakpoint enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>In protocol packets</name>
                    <description>of each byte, including the header byte, but not including the last byte of a 7-byte packet, is a continuation bit, C</description>
                    <bitRange>[7:7]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>This is the last byte of the packet</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>This is not the last byte of the packet</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
