ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>ICB</name>
            <description>Implementation Control Block</description>
            <groupName></groupName>
            <baseAddress>0xE000E004</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0xC</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Interrupt Controller Type Register</name>
                <displayName>ICTR</displayName>
                <description>Provides information about the interrupt controller</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>INTLINESNUM_%s</name>
                    <description>The total number of interrupt lines supported by an implementation, defined in groups of 32</description>
                    <bitRange>[3:0]</bitRange>
                    <dim>2</dim>
                    <dimIncrement>16</dimIncrement>
                  </field>
                </fields>
              </register>
              <register>
                <name>Auxiliary Control Register</name>
                <displayName>ACTLR</displayName>
                <description>Provides IMPLEMENTATION DEFINED configuration and control options</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
              </register>
            </registers>
          </peripheral>
          <peripheral>
            <name>SYSTICK</name>
            <description>SysTick Timer</description>
            <groupName></groupName>
            <baseAddress>0xE000E010</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x10</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>SysTick Control and Status Register</name>
                <displayName>SYST_CSR</displayName>
                <description>Controls the system timer and provides status data</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>COUNTFLAG</name>
                    <description>Indicates whether the counter has counted to 0 since the last read of this register</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Timer has not counted to 0</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Timer has counted to 0</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CLKSOURCE</name>
                    <description>Indicates the SysTick clock source</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>SysTick uses the IMPLEMENTATION DEFINED external reference clock</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>SysTick uses the processor clock</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TICKINT</name>
                    <description>Indicates whether counting to 0 causes the status of the SysTick exception to change to pending</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Count to 0 does not affect the SysTick exception status</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Count to 0 changes the SysTick exception status to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE</name>
                    <description>Indicates the enabled status of the SysTick counter</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Counter is disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Counter is operating</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>SysTick Reload Value Register</name>
                <displayName>SYST_RVR</displayName>
                <description>Holds the reload value of the SYST_CVR</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>RELOAD</name>
                    <description>The value to load into the SYST_CVR when the counter reaches 0</description>
                    <bitRange>[23:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>SysTick Current Value Register</name>
                <displayName>SYST_CVR</displayName>
                <description>Reads or clears the current counter value</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CURRENT</name>
                    <description>Current counter value</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>SysTick Calibration value Register</name>
                <displayName>SYST_CALIB</displayName>
                <description>Reads the calibration value and parameters for SysTick</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>NOREF</name>
                    <description>Indicates whether the IMPLEMENTATION DEFINED reference clock is implemented</description>
                    <bitRange>[31:31]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>The reference clock is implemented</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>The reference clock is not implemented</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SKEW</name>
                    <description>Indicates whether the 10ms calibration value is exact</description>
                    <bitRange>[30:30]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>10ms calibration value is exact</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>10ms calibration value is inexact, because of the clock frequency</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TENMS</name>
                    <description>Optionally, holds a reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors</description>
                    <bitRange>[23:0]</bitRange>
                  </field>
                </fields>
              </register>
