ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>NVIC</name>
            <description>Nested Vectored Interrupt Controller</description>
            <groupName></groupName>
            <baseAddress>0xE000E100</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x4F0</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Interrupt Set-Enable Register %s</name>
                <displayName>NVIC_ISER_%s</displayName>
                <description>Enables, or reads the enable state of a group of interrupts</description>
                <addressOffset>0x0</addressOffset>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>SETENA_%s</name>
                    <description>For register NVIC_ISERn, enables or shows the current enabled state of interrupt (m+(32*n))</description>
                    <bitRange>[0:0]</bitRange>
                    <dim>32</dim>
                    <dimIncrement>1</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On reads, interrupt disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On reads, interrupt enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Clear-Enable Register %s</name>
                <displayName>NVIC_ICER_%s</displayName>
                <description>Disables, or reads the enable state of, a group of registers</description>
                <addressOffset>0x80</addressOffset>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CLRENA_%s</name>
                    <description>For register NVIC_ICERn, disables or shows the current enabled state of interrupt (m+(32*n))</description>
                    <bitRange>[0:0]</bitRange>
                    <dim>32</dim>
                    <dimIncrement>1</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On reads, interrupt disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On reads, interrupt enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Set-Pending Register %s</name>
                <displayName>NVIC_ISPR_%s</displayName>
                <description>For a group of interrupts, changes interrupt status to pending, or shows the current pending status</description>
                <addressOffset>0x100</addressOffset>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>SETPEND_%s</name>
                    <description>For register NVIC_ISPRn, changes the state of interrupt (m+(32*n)) to pending, or shows whether the state of the interrupt is pending</description>
                    <bitRange>[0:0]</bitRange>
                    <dim>32</dim>
                    <dimIncrement>1</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On reads, interrupt is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On reads, interrupt is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Clear-Pending Register %s</name>
                <displayName>NVIC_ICPR_%s</displayName>
                <description>For a group of interrupts, clears the interrupt pending status, or shows the current pending status</description>
                <addressOffset>0x180</addressOffset>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CLRPEND_%s</name>
                    <description>For register NVIC_ICPRn, clears the pending state of interrupt (m+(32*n)), or shows whether the state of the interrupt is pending</description>
                    <bitRange>[0:0]</bitRange>
                    <dim>32</dim>
                    <dimIncrement>1</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On reads, interrupt is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On reads, interrupt is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Active Bit Register %s</name>
                <displayName>NVIC_IABR_%s</displayName>
                <description>For a group of 32 interrupts, shows whether each interrupt is active</description>
                <addressOffset>0x200</addressOffset>
                <dim>16</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>ACTIVE_%s</name>
                    <description>For register NVIC_IABRn, shows whether interrupt (m+(32*n)) is active</description>
                    <bitRange>[0:0]</bitRange>
                    <dim>32</dim>
                    <dimIncrement>1</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Interrupt not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Interrupt active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Priority Register %s</name>
                <displayName>NVIC_IPR_%s</displayName>
                <description>Sets or reads interrupt priorities</description>
                <addressOffset>0x300</addressOffset>
                <dim>124</dim>
                <dimIncrement>4</dimIncrement>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRI_N3</name>
                    <description>For register NVIC_IPRn, priority of interrupt number 4n+3</description>
                    <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                    <name>PRI_N2</name>
                    <description>For register NVIC_IPRn, priority of interrupt number 4n+2</description>
                    <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                    <name>PRI_N1</name>
                    <description>For register NVIC_IPRn, priority of interrupt number 4n+1</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>PRI_N0</name>
                    <description>For register NVIC_IPRn, priority of interrupt number 4n</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
