ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>SCB</name>
            <description>System Control Block</description>
            <groupName></groupName>
            <baseAddress>0xE000ED00</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x90</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>CPUID Base Register</name>
                <displayName>CPUID</displayName>
                <description>Provides identification information for the processor</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>IMPLEMENTER</name>
                    <description>Implementer code assigned by ARM</description>
                    <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                    <name>VARIANT</name>
                    <description>IMPLEMENTATION DEFINED variant number</description>
                    <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                    <name>ARCHITECTURE</name>
                    <description>Reads as 0xF</description>
                    <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                    <name>PARTNO</name>
                    <description>IMPLEMENTATION DEFINED part number</description>
                    <bitRange>[15:4]</bitRange>
                  </field>
                  <field>
                    <name>REVISION</name>
                    <description>IMPLEMENTATION DEFINED revision number</description>
                    <bitRange>[3:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Interrupt Control and State Register</name>
                <displayName>ICSR</displayName>
                <description>Provides software control of the NMI, PendSV, and SysTick exceptions, and provides interrupt status information</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>NMIPENDSET</name>
                    <description>On writes, makes the NMI exception active</description>
                    <bitRange>[31:31]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On writes, has no effect. On reads, NMI is inactive</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On writes, make the NMI exception active. On reads, NMI is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PENDSVSET</name>
                    <description>On writes, sets the PendSV exception as pending</description>
                    <bitRange>[28:28]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On writes, has no effect. On reads, PendSV is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On writes, make PendSV exception pending. On reads, PendSV is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PENDSVCLR</name>
                    <description>Removes the pending status of the PendSV exception</description>
                    <bitRange>[27:27]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No effect</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Remove pending status</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PENDSTSET</name>
                    <description>On writes, sets the SysTick exception as pending</description>
                    <bitRange>[26:26]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>On writes, has no effect. On reads, SysTick is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>On writes, make SysTick exception pending. On reads, SysTick is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PENDSTCLR</name>
                    <description>Removes the pending status of the SysTick exception</description>
                    <bitRange>[25:25]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No effect</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Remove pending status</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ISRPREEMPT</name>
                    <description>Indicates whether a pending exception will be serviced on exit from debug halt state</description>
                    <bitRange>[23:23]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Will not service</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Will service a pending exception</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ISRPENDING</name>
                    <description>Indicates whether an external interrupt, generated by the NVIC, is pending</description>
                    <bitRange>[22:22]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No external interrupt pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>External interrupt pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VECTPENDING</name>
                    <description>The exception number of the highest priority pending and enabled interrupt</description>
                    <bitRange>[20:12]</bitRange>
                  </field>
                  <field>
                    <name>RETTOBASE</name>
                    <description>In Handler mode, indicates whether there is an active exception other than the exception indicated by the current value of the IPSR</description>
                    <bitRange>[11:11]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>There is an active exception other than the exception shown by IPSR</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>There is no active exception other than any exception shown by IPSR</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VECTACTIVE</name>
                    <description>The exception number of the current executing exception</description>
                    <bitRange>[8:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Vector Table Offset Register</name>
                <displayName>VTOR</displayName>
                <description>Holds the vector table address</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>TBLOFF</name>
                    <description>Bits[31:7] of the vector table address</description>
                    <bitRange>[31:7]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Application Interrupt and Reset Control Register</name>
                <displayName>AIRCR</displayName>
                <description>Sets or returns interrupt control data</description>
                <addressOffset>0xC</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>ENDIANNESS</name>
                    <description>Indicates the memory system endianness</description>
                    <bitRange>[15:15]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Little endian</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Big endian</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PRIGROUP</name>
                    <description>Priority grouping, indicates the binary point position</description>
                    <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                    <name>SYSRESETREQ</name>
                    <description>System Reset Request</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Do not request a reset</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Request reset</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VECTCLRACTIVE</name>
                    <description>Writing 1 to this bit clears all active state information for fixed and configurable exceptions</description>
                    <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                    <name>VECTRESET</name>
                    <description>Writing 1 to this bit causes a local system reset</description>
                    <bitRange>[0:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>System Control Register</name>
                <displayName>SCR</displayName>
                <description>Sets or returns system control data</description>
                <addressOffset>0x10</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>SEVONPEND</name>
                    <description>Determines whether an interrupt transition from inactive state to pending state is a wakeup event</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Transitions from inactive to pending are not wakeup events</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Transitions from inactive to pending are wakeup events</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SLEEPDEEP</name>
                    <description>Provides a qualifying hint indicating that waking from sleep might take longer</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Selected sleep state is not deep sleep</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Selected sleep state is deep sleep</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SLEEPONEXIT</name>
                    <description>Determines whether, on an exit from an ISR that returns to the base level of execution priority, the processor enters a sleep state</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Do not enter sleep state</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enter sleep state</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Configuration and Control Register</name>
                <displayName>CCR</displayName>
                <description>Sets or returns configuration and control data, and provides control over caching and branch prediction</description>
                <addressOffset>0x14</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>BP</name>
                    <description>Branch prediction enable bit</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Program flow prediction disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Program flow prediction enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>IC</name>
                    <description>Instruction cache enable bit</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Instruction caches disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Instruction caches enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DC</name>
                    <description>Cache enable bit</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Data and unified caches disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Data and unified caches enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>STKALIGN</name>
                    <description>Determines whether the exception entry sequence guarantees 8-byte stack frame alignment, adjusting the SP if necessary before saving state</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Guaranteed SP alignment is 4-byte, no SP adjustment is performed</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>8-byte alignment guaranteed, SP adjusted if necessary</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BFHFNMIGN</name>
                    <description>Determines the effect of precise data access faults on handlers running at priority -1 or priority -2</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Precise data access fault causes a lockup</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Handler ignores the fault</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DIV_0_TRP</name>
                    <description>Controls the trap on divide by 0</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Trapping disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Trapping enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>UNALIGN_TRP</name>
                    <description>Controls the trapping of unaligned word or halfword accesses</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Trapping disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Trapping enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>USERSETMPEND</name>
                    <description>Controls whether unprivileged software can access the STIR</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Unprivileged software cannot access the STIR</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Unprivileged software can access the STIR</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NONBASETHRDENA</name>
                    <description>Controls whether the processor can enter Thread mode with exceptions active</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Any attempt to enter Thread mode with exceptions active faults</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>The processor can enter Thread mode with exceptions active because of a controlled return value</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>System Handler Priority Register 1</name>
                <displayName>SHPR1</displayName>
                <description>Sets or returns priority for system handlers 4-7</description>
                <addressOffset>0x18</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRI_7</name>
                    <description>Reserved for priority of system handler 7</description>
                    <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                    <name>PRI_6</name>
                    <description>Priority of system handler 6, UsageFault</description>
                    <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                    <name>PRI_5</name>
                    <description>Priority of system handler 5, BusFault</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>PRI_4</name>
                    <description>Priority of system handler 4, MemManage</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
