ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>System Handler Priority Register 2</name>
                <displayName>SHPR2</displayName>
                <description>Sets or returns priority for system handlers 8-11</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRI_11</name>
                    <description>Priority of system handler 11, SVCall</description>
                    <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                    <name>PRI_10</name>
                    <description>Reserved for priority of system handler 10</description>
                    <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                    <name>PRI_9</name>
                    <description>Reserved for priority of system handler 9</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>PRI_8</name>
                    <description>Reserved for priority of system handler 8</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>System Handler Priority Register 3</name>
                <displayName>SHPR3</displayName>
                <description>Sets or returns priority for system handlers 12-15</description>
                <addressOffset>0x20</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRI_15</name>
                    <description>Priority of system handler 15, SysTick</description>
                    <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                    <name>PRI_14</name>
                    <description>Priority of system handler 14, PendSV</description>
                    <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                    <name>PRI_13</name>
                    <description>Reserved for priority of system handler 13</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>PRI_12</name>
                    <description>Priority of system handler 12, DebugMonitor</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>System Handler Control and State Register</name>
                <displayName>SHCSR</displayName>
                <description>Controls and provides the active and pending status of system exceptions</description>
                <addressOffset>0x24</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>USGFAULTENA</name>
                    <description>UsageFault exception enable</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disable UsageFault</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enable UsageFault</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BUSFAULTENA</name>
                    <description>BusFault exception enable</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disable BusFault</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enable BusFault</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MEMFAULTENA</name>
                    <description>MemManage exception enable</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disable MemManage fault</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enable MemManage fault</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SVCALLPENDED</name>
                    <description>SVCall exception pended state</description>
                    <bitRange>[15:15]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>SVCall execption is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>SVCall execption is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BUSFAULTPENDED</name>
                    <description>BusFault exception pended state</description>
                    <bitRange>[14:14]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>BusFault execption is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>BusFault execption is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MEMFAULTPENDED</name>
                    <description>MemManage exception pended state</description>
                    <bitRange>[13:13]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>MemManage exception is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MemManage exception is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>USGFAULTPENDED</name>
                    <description>UsageFault exception pended state</description>
                    <bitRange>[12:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>UsageFault exception is not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>UsageFault exception is pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SYSTICKACT</name>
                    <description>SysTick exception active state</description>
                    <bitRange>[11:11]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>SysTick exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>SysTick exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PENDSVACT</name>
                    <description>PendSV exception active state</description>
                    <bitRange>[10:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>PendSV exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>PendSV exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MONITORACT</name>
                    <description>DebugMonitor exception active state</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>DebugMonitor exception not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>DebugMonitor exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SVCALLACT</name>
                    <description>SVCall exception active state</description>
                    <bitRange>[7:7]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>SVCall exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>SVCall exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>USGFAULTACT</name>
                    <description>UsageFault exception active state</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>UsageFault exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>UsageFault exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BUSFAULTACT</name>
                    <description>BusFault exception active state</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>BusFault exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>BusFault exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MEMFAULTACT</name>
                    <description>MemManage exception active state</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>MemManage exception is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MemManage exception is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Configurable Fault Status Register</name>
                <displayName>CFSR</displayName>
                <description>Contains the three Configurable Fault Status Registers</description>
                <addressOffset>0x28</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>UsageFault</name>
                    <description>Provides information on UsageFault exceptions</description>
                    <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                    <name>BusFault</name>
                    <description>Provides information on BusFault exceptions</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>MemManage</name>
                    <description>Provides information on MemManage exceptions</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Usage Fault Status Register</name>
                <displayName>UFSR</displayName>
                <description>Provides information on UsageFault exceptions</description>
                <addressOffset>0x28</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>DIVBYZERO</name>
                    <description>Divide by zero flag. Indicates whether an integer division by zero error has occurred</description>
                    <bitRange>[25:25]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>UNALIGNED</name>
                    <description>Unaligned access flag. Indicates whether an unaligned access error has occurred</description>
                    <bitRange>[24:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>NOCP</name>
                    <description>No coprocessor flag. Indicates whether a coprocessor disabled or not present error has occurred</description>
                    <bitRange>[19:19]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INVPC</name>
                    <description>Invalid PC flag. Indicates whether an integrity check error has occurred</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INVSTATE</name>
                    <description>Invalid state flag. Indicates whether an EPSR.T or EPSR.IT validity error has occurred</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>UNDEFINSTR</name>
                    <description>Undefined instruction flag. Indicates whether an undefined instruction error has occurred</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Error has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
