ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>Bus Fault Status Register</name>
                <displayName>BFSR</displayName>
                <description>Provides information on BusFault exceptions</description>
                <addressOffset>0x28</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>BFARVALID</name>
                    <description>BFAR valid. Indicates validity of the contents of the BFAR register</description>
                    <bitRange>[15:15]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>BFAR content not valid</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>BFAR content valid</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LSPERR</name>
                    <description>Lazy state preservation error. Records whether a BusFault occurred during FP lazy state preservation</description>
                    <bitRange>[13:13]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No BusFault occurred during FP lazy state preservation</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>BusFault occurred during FP lazy state preservation</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>STKERR</name>
                    <description>Stack error. Records whether a derived BusFault occurred during exception entry stacking</description>
                    <bitRange>[12:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No derived BusFault occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Derived BusFault occurred during exception entry</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>UNSTKERR</name>
                    <description>Unstack error. Records whether a derived BusFault occurred during exception return unstacking</description>
                    <bitRange>[11:11]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No derived BusFault occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Derived BusFault occurred during exception return</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>IMPRECISERR</name>
                    <description>Imprecise error. Records whether an imprecise data access error has occurred</description>
                    <bitRange>[10:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No imprecise data access error has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Imprecise data access error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PRECISERR</name>
                    <description>Precise error. Records whether a precise data access error has occurred</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No precise data access error has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Precise data access error has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>IBUSERR</name>
                    <description>Instruction bus error. Records whether a BusFault on an instruction prefetch has occurred</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No BusFault on instruction prefetch has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>A BusFault on an instruction prefetch has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>MemManage Fault Status Register</name>
                <displayName>MMFSR</displayName>
                <description>Provides information on MemManage exceptions</description>
                <addressOffset>0x28</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>MMARVALID</name>
                    <description>MMFAR valid flag. Indicates validity of the MMFAR register</description>
                    <bitRange>[7:7]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>MMFAR content not valid</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MMFAR content valid</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MLSPERR</name>
                    <description>MemManage lazy state preservation error flag. Records whether a MemManage fault occurred during FP lazy state preservation</description>
                    <bitRange>[5:5]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No MemManage occurred during FP lazy state preservation</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MemManage occurred during FP lazy state preservation</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MSTKERR</name>
                    <description>MemManage stacking error flag. Records whether a derived MemManage fault occurred during exception entry stacking</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No derived MemManage occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Derived MemManage occurred during exception entry</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MUNSTKERR</name>
                    <description>MemManage unstacking error flag. Records whether a derived MemManage fault occurred during exception return unstacking</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No derived MemManage fault occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Derived MemManage fault occurred during exception return</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DACCVIOL</name>
                    <description>Data access violation flag. Records whether a data access violation has occurred</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No MemManage fault on data access has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MemManage fault on data access has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>IACCVIOL</name>
                    <description>Instruction access violation. Records whether an instruction related memory access violation has occurred</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No MemManage fault on instruction access has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>MemManage fault on instruction access has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>HardFault Status Register</name>
                <displayName>HFSR</displayName>
                <description>Shows the cause of any HardFault</description>
                <addressOffset>0x2C</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>DEBUGEVT</name>
                    <description>Indicates that a debug event has occurred</description>
                    <bitRange>[31:31]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No debug event has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred. The Debug Fault Status Register has been updated</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FORCED</name>
                    <description>Indicates that a fault with configurable priority has been escalated to a HardFault exception, because it could not be made active, because of priority or because it was disabled</description>
                    <bitRange>[30:30]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No priority escalation has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Processor has escalated a configurable-priority exception to HardFault</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VECTTBL</name>
                    <description>Indicates when a fault has occurred because of a vector table read error on exception processing</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No vector table read fault has occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Vector table read fault has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Debug Fault Status Register</name>
                <displayName>DFSR</displayName>
                <description>Shows which debug event occurred</description>
                <addressOffset>0x30</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>EXTERNAL</name>
                    <description>External event. Indicates whether an external debug request has occurred</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Debug event has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VCATCH</name>
                    <description>Vector Catch event. Indicates whether a Vector catch debug event has occurred</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Debug event has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>DWTTRAP</name>
                    <description>Watchpoint event. Indicates whether a Watchpoint debug event has occurred</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Debug event has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BKPT</name>
                    <description>Breakpoint event. Indicates whether a breakpoint debug event has occurred</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Debug event has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>HALTED</name>
                    <description>Halt or step event. Indicates that a Halt request debug event or Step debug event has occurred</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Debug event has not occurred</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Debug event has occurred</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>MemManage Fault Address Register</name>
                <displayName>MMFAR</displayName>
                <description>Shows the address of the memory location that caused an MPU fault</description>
                <addressOffset>0x34</addressOffset>
                <access>read-write</access>
              </register>
              <register>
                <name>BusFault Address Register</name>
                <displayName>BFAR</displayName>
                <description>Shows the address associated with a precise data access BusFault</description>
                <addressOffset>0x38</addressOffset>
                <access>read-write</access>
              </register>
              <register>
                <name>Auxiliary Fault Status Register</name>
                <displayName>AFSR</displayName>
                <description>Provides implementation-specific fault status information and control</description>
                <addressOffset>0x3C</addressOffset>
                <access>read-write</access>
              </register>
              <register>
                <name>Processor Feature Register 0</name>
                <displayName>ID_PFR0</displayName>
                <description>Gives top-level information about the instruction sets supported by the processor</description>
                <addressOffset>0x40</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>State3</name>
                    <description>ARMv7-M reserved</description>
                    <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                    <name>State2</name>
                    <description>ARMv7-M reserved</description>
                    <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                    <name>State1</name>
                    <description>Thumb instruction set support</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Support for Thumb encoding including Thumb-2 technology, with all basic 16-bit and 32-bit instructions</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>State0</name>
                    <description>ARM instruction set support</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>The processor does not support the ARM instruction set</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Processor Feature Register 1</name>
                <displayName>ID_PFR1</displayName>
                <description>Gives top-level information about the instruction sets supported by the processor</description>
                <addressOffset>0x44</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>M profile programmers model</name>
                    <description></description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Two-stack programmers model supported</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Debug Feature Register 0</name>
                <displayName>ID_DFR0</displayName>
                <description>Gives top-level information about the debug system used in the processor</description>
                <addressOffset>0x48</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Debug model, M profile</name>
                    <description>Support for memory-mapped debug model for M profile processors</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Support for M profile Debug architecture, with memory-mapped access</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
