ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>Auxiliary Feature Register 0</name>
                <displayName>ID_AFR0</displayName>
                <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation</description>
                <addressOffset>0x4C</addressOffset>
                <access>read-only</access>
              </register>
              <register>
                <name>Memory Model Feature Register 0</name>
                <displayName>ID_MMFR0</displayName>
                <description>Gives information about the implemented memory model and memory management support</description>
                <addressOffset>0x50</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Auxiliary registers</name>
                    <description>Indicates the support for Auxiliary registers</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Support for Auxiliary Control Register only</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TCM support</name>
                    <description>Indicates the support for Tightly Coupled Memory (TCM)</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No tightly coupled memories implemented</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Tightly coupled memories implemented with IMPLEMENTATION DEFINED control</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Shareability levels</name>
                    <description>Indicates the number of shareability levels implemented</description>
                    <bitRange>[15:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>One level of shareability implemented</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Outermost shareability</name>
                    <description>Indicates the outermost shareability domain implemented</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Implemented as Non-cacheable</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Shareability ignored</description>
                        <value>15</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PMSA support</name>
                    <description>Indicates support for a PMSA</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>PMSAv7, providing support for a base region and subregions</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Memory Model Feature Register 1</name>
                <displayName>ID_MMFR1</displayName>
                <description>Gives information about the implemented memory model and memory management support</description>
                <addressOffset>0x54</addressOffset>
                <access>read-only</access>
              </register>
              <register>
                <name>Memory Model Feature Register 2</name>
                <displayName>ID_MMFR2</displayName>
                <description>Gives information about the implemented memory model and memory management support</description>
                <addressOffset>0x58</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>WFI stall</name>
                    <description>Indicates the support for Wait For Interrupt (WFI) stalling</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Support for WFI stalling</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Memory Model Feature Register 3</name>
                <displayName>ID_MMFR3</displayName>
                <description>Gives information about the implemented memory model and memory management support</description>
                <addressOffset>0x5C</addressOffset>
                <access>read-only</access>
              </register>
              <register>
                <name>Instruction Set Attribute Register 0</name>
                <displayName>ID_ISAR0</displayName>
                <description>Gives information about the instruction sets implemented by the processor</description>
                <addressOffset>0x60</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Divide_instrs</name>
                    <description>Indicates the supported Divide instructions</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the SDIV and UDIV instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Debug_instrs</name>
                    <description>Indicates the supported Debug instructions</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the BKPT instruction</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Coproc_instrs</name>
                    <description>Indicates the supported Coprocessor instructions</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, except for separately attributed architectures, for example the Floating-point extension</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for generic CDP, LDC, MCR, MRC, and STC instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for generic CDP2, LDC2, MCR2, MRC2, and STC2 instructions</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 2, and adds support for generic MCRR and MRRC instructions, 4 As for 3, and adds support for generic MCRR2 and MRRC2 inst</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CmpBranch_instrs</name>
                    <description>Indicates the supported combined Compare and Branch instructions</description>
                    <bitRange>[15:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the CBNZ and CBZ instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Bitfield_instrs</name>
                    <description>Indicates the supported BitField instructions</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the BFC, BFI, SBFX, and UBFX instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BitCount_instrs</name>
                    <description>Indicates the supported Bit Counting instructions</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the CLZ instruction</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Instruction Set Attribute Register 1</name>
                <displayName>ID_ISAR1</displayName>
                <description>Gives information about the instruction sets implemented by the processor</description>
                <addressOffset>0x64</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Interwork_instrs</name>
                    <description>Indicates the supported Interworking instructions</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the BX instruction, and the T bit in the PSR</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the BLX instruction, and PC loads have BX-like behavior</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Immediate_instrs</name>
                    <description>Indicates the support for data-processing instructions with long immediates</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the ADDW, MOVW, MOVT, and SUBW instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>IfThen_instrs</name>
                    <description>Indicates the supported IfThen instructions</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the IT instructions, and for the IT bits in the PSRs</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Extend_instrs</name>
                    <description>Indicates the supported Extend instructions</description>
                    <bitRange>[15:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the SXTB, SXTH, UXTB, and UXTH instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the SXTAB, SXTAB16, SXTAH, SXTB16, UXTAB, UXTAB16, UXTAH, and UXTB16 instructions</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
