ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>Instruction Set Attribute Register 2</name>
                <displayName>ID_ISAR2</displayName>
                <description>Gives information about the instruction sets implemented by the processor</description>
                <addressOffset>0x68</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Reversal_instrs</name>
                    <description>Indicates the supported Reversal instructions</description>
                    <bitRange>[31:28]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the REV, REV16, and REVSH instructions, ARMv7-M reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the RBIT instruction</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MultU_instrs</name>
                    <description>Indicates the supported advanced unsigned Multiply instructions</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the UMULL and UMLAL instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the UMAAL instruction</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MultS_instrs</name>
                    <description>Indicates the supported advanced signed Multiply instructions</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the SMULL and SMLAL instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the SMLABB, SMLABT, SMLALBB, SMLALBT, SMLALTB, SMLALTT, SMLATB, SMLATT, SMLAWB, SMLAWT, SMULBB, S</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 2, and adds support for the SMLAD, SMLADX, SMLALD, SMLALDX, SMLSD, SMLSDX, SMLSLD, SMLSLDX, SMMLA, SMMLAR, SMMLS, SMMLSR,</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Mult_instrs</name>
                    <description>Indicates the supported additional Multiply instructions</description>
                    <bitRange>[15:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported. This means only MUL is supported. ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the MLA instruction, ARMv7-M reserved</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the MLS instruction</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MultiAccessInt_instrs</name>
                    <description>Indicates the support for multi-access interruptible instructions</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported. This means the LDM and STM instructions are not interruptible</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>LDM and STM instructions are restartable</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>LDM and STM instructions are continuable</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MemHint_instrs</name>
                    <description>Indicates the supported Memory Hint instructions</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the PLD instruction</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1 or 2, and adds support for the PLI instruction</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LoadStore_instrs</name>
                    <description>Indicates the supported additional load and store instructions</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the LDRD and STRD instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Instruction Set Attribute Register 3</name>
                <displayName>ID_ISAR3</displayName>
                <description>Gives information about the instruction sets implemented by the processor</description>
                <addressOffset>0x6C</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>TrueNOP_instrs</name>
                    <description>Indicates the support for a true NOP instruction</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the true NOP instruction</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ThumbCopy_instrs</name>
                    <description>Indicates the supported non flag-setting MOV instructions</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for encoding T1 of the MOV (register) instruction copying from a low register to a low register</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>TabBranch_instrs</name>
                    <description>Indicates the supported Table Branch instructions</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the TBB and TBH instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SynchPrim_instrs</name>
                    <description>Must be interpreted with the ID_ISAR4</description>
                    <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                    <name>SVC_instrs</name>
                    <description>Indicates the supported SVC instructions</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the SVC instruction</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SIMD_instrs</name>
                    <description>Indicates the supported SIMD instructions</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the SSAT and USAT instructions, and for the Q bit in the PSRs</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Reserved</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the PKHBT, PKHTB, QADD16, QADD8, QASX, QSUB16, QSUB8, QSAX, SADD16, SADD8, SASX, SEL, SHADD16, SH</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Saturate_instrs</name>
                    <description>Indicates the supported Saturate instructions</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the QADD, QDADD, QDSUB, and QSUB instructions, and for the Q bit in the PSRs</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Instruction Set Attribute Register 4</name>
                <displayName>ID_ISAR4</displayName>
                <description>Gives information about the instruction sets implemented by the processor</description>
                <addressOffset>0x70</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>PSR_M_instrs</name>
                    <description>Indicates the supported M profile instructions to modify the PSRs</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the M-profile forms of the CPS, MRS, and MSR instructions, to access the PSRs</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SynchPrim_instrs_frac</name>
                    <description>Must be interpreted with the ID_ISAR3</description>
                    <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                    <name>Barrier_instrs</name>
                    <description>Indicates the supported Barrier instructions</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the DMB, DSB, and ISB barrier instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Writeback_instrs</name>
                    <description>Indicates the support for Writeback addressing modes</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Basic support</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for all of the writeback addressing modes defined in the ARMv7-M architecture</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>WithShifts_instrs</name>
                    <description>Indicates the support for instructions with shifts</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Nonzero shifts supported only in MOV and shift instructions</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for shifts of loads and stores over the range LSL 0-3</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Reserved</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for other constant shift options, on loads, stores, and other instructions</description>
                        <value>3</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>ARMv7-M reserved</description>
                        <value>4</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Unpriv_instrs</name>
                    <description>Indicates the supported unprivileged instructions</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>None supported, ARMv7-M reserved</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Adds support for the LDRBT, LDRT, STRBT, and STRT instructions</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 1, and adds support for the LDRHT, LDRSBT, LDRSHT, and STRHT instructions</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Cache Level ID Register</name>
                <displayName>CLIDR</displayName>
                <description>The CLIDR identifies: ? The type of cache, or caches, implemented at each level, up to a maximum of seven levels</description>
                <addressOffset>0x78</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>LoUU</name>
                    <description>Level of Unification Uniprocessor for the cache hierarchy</description>
                    <bitRange>[29:27]</bitRange>
                  </field>
                  <field>
                    <name>LoC</name>
                    <description>Level of Coherency for the cache hierarchy</description>
                    <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                    <name>LoUIS</name>
                    <description>Level of Unification Inner Shareable for the cache hierarchy</description>
                    <bitRange>[23:21]</bitRange>
                  </field>
                  <field>
                    <name>CType_%s</name>
                    <description>Indicates the type of cache implemented at each level</description>
                    <bitRange>[1:0]</bitRange>
                    <dim>7</dim>
                    <dimIncrement>2</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No cache</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Instruction cache only</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Data cache only</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Separate instruction and data caches</description>
                        <value>3</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Unified cache</description>
                        <value>4</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Cache Type Register</name>
                <displayName>CTR</displayName>
                <description>The CTR provides information about the architecture of the caches</description>
                <addressOffset>0x7C</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Format</name>
                    <description>Indicates the implemented CTR format</description>
                    <bitRange>[31:29]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>ARMv7 format. This is the format described in this section</description>
                        <value>4</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CWG</name>
                    <description>Cache Write-back Granule</description>
                    <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                    <name>ERG</name>
                    <description>Exclusives Reservation Granule</description>
                    <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                    <name>DminLine</name>
                    <description>Log2 of the number of words in the smallest cache line of all the data caches and unified caches that are controlled by the processor</description>
                    <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                    <name>IminLine</name>
                    <description>Log2 of the number of words in the smallest cache line of all the instruction caches that are controlled by the processor</description>
                    <bitRange>[3:0]</bitRange>
                  </field>
                </fields>
              </register>
