ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
              <register>
                <name>Cache Size ID Registers</name>
                <displayName>CCSIDR</displayName>
                <description>The CCSIDR provides information about the architecture of the caches</description>
                <addressOffset>0x80</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>WT</name>
                    <description>Indicates whether the cache level supports write-through</description>
                    <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                    <name>WB</name>
                    <description>Indicates whether the cache level supports write-back</description>
                    <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                    <name>RA</name>
                    <description>Indicates whether the cache level supports read-allocation</description>
                    <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                    <name>WA</name>
                    <description>Indicates whether the cache level supports write-allocation</description>
                    <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                    <name>NumSets</name>
                    <description>(Number of sets in cache)-1, therefore a value of 0 indicates 1 set in the cache</description>
                    <bitRange>[27:13]</bitRange>
                  </field>
                  <field>
                    <name>Associativity</name>
                    <description>(Associativity of cache)-1, therefore a value of 0 indicates an associativity of 1</description>
                    <bitRange>[12:3]</bitRange>
                  </field>
                  <field>
                    <name>LineSize</name>
                    <description>(Log2(Number of words in cache line))-2</description>
                    <bitRange>[2:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Cache Size Selection Register</name>
                <displayName>CSSELR</displayName>
                <description>The CSSELR selects the current CCSIDR by specifying the required cache level</description>
                <addressOffset>0x84</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>Level</name>
                    <description>Cache level of required cache</description>
                    <bitRange>[3:1]</bitRange>
                  </field>
                  <field>
                    <name>InD</name>
                    <description>Instruction not data bit</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Data or unified cache</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Instruction cache</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Coprocessor Access Control Register</name>
                <displayName>CPACR</displayName>
                <description>Specifies the access privileges for coprocessors</description>
                <addressOffset>0x88</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CP_%s</name>
                    <description>for n values 0-7, 10 and 11 Access privileges for coprocessor n</description>
                    <bitRange>[1:0]</bitRange>
                    <dim>16</dim>
                    <dimIncrement>2</dimIncrement>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Access denied. Any attempted access generates a NOCP UsageFault</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Privileged access only. An unprivileged access generates a NOCP UsageFault</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Reserved</description>
                        <value>2</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Full access</description>
                        <value>3</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </registers>
          </peripheral>
          <peripheral>
            <name>MPU</name>
            <description>Memory Protection Unit</description>
            <groupName></groupName>
            <baseAddress>0xE000ED90</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x2C</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>MPU Type Register</name>
                <displayName>MPU_TYPE</displayName>
                <description>The MPU Type Register indicates how many regions the MPU support</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>IREGION</name>
                    <description>Instruction region</description>
                    <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                    <name>DREGION</name>
                    <description>Number of regions supported by the MPU</description>
                    <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                    <name>SEPARATE</name>
                    <description>Indicates support for separate instruction and data address maps. RAZ. ARMv7-M only supports a unified MPU</description>
                    <bitRange>[0:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>MPU Control Register</name>
                <displayName>MPU_CTRL</displayName>
                <description>Enables the MPU, and when the MPU is enabled, controls whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults, NMIs</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>PRIVDEFENA</name>
                    <description>When the ENABLE bit is set to 1, the meaning of this bit is</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disables the default memory map</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enables the default memory map as a background region for privileged access</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>HFNMIENA</name>
                    <description>When the ENABLE bit is set to 1, controls whether handlers executing with priority less than 0 access memory with the MPU enabled or with the MPU disabled</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disables the MPU for these handlers</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Use the MPU for memory accesses by these handlers</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE</name>
                    <description>Enables the MPU</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>The MPU is disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>The MPU is enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>MPU Region Number Register</name>
                <displayName>MPU_RNR</displayName>
                <description>Selects the region currently accessed by MPU_RBAR and MPU_RASR</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>REGION</name>
                    <description>Indicates the memory region accessed by MPU_RBAR and MPU_RASR</description>
                    <bitRange>[7:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>MPU Region Base Address Register</name>
                <displayName>MPU_RBAR</displayName>
                <description>Holds the base address of the region identified by MPU_RNR</description>
                <addressOffset>0xC</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>ADDR</name>
                    <description>Base address of the region</description>
                    <bitRange>[31:5]</bitRange>
                  </field>
                  <field>
                    <name>VALID</name>
                    <description>On writes, indicates whether the region to update is specified by MPU_RNR</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Apply the base address update to the region specified by MPU_RNR.REGION</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>
                        Update MPU_RNR.REGION to the value obtained by zero extending the
                        REGION value specified in this write
                      </description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>REGION</name>
                    <description>On writes, can specify the number of the region to update</description>
                    <bitRange>[3:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>MPU Region Attribute and Size Register</name>
                <displayName>MPU_RASR</displayName>
                <description>Defines the size and access behavior of the region identified by MPU_RNR, and enables that region</description>
                <addressOffset>0x10</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>ATTRS</name>
                    <description>The MPU Region Attribute field</description>
                    <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                    <name>SRD</name>
                    <description>Subregion Disable</description>
                    <bitRange>[15:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Subregion enabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Subregion disabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>SIZE</name>
                    <description>Indicates the region size</description>
                    <bitRange>[5:1]</bitRange>
                  </field>
                  <field>
                    <name>ENABLE</name>
                    <description>Enables this region</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>When the MPU is enabled, this region is disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>When the MPU is enabled, this region is enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
