ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>DCB</name>
            <description>Debug Control Block</description>
            <groupName></groupName>
            <baseAddress>0xE000EDF0</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x10</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Debug Halting Control and Status Register</name>
                <displayName>DHCSR</displayName>
                <description>Controls halting debug</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>DBGKEY</name>
                    <description>Debug key</description>
                    <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                    <name>S_RESET_ST</name>
                    <description>Indicates whether the processor has been reset since the last read of DHCSR</description>
                    <bitRange>[25:25]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No reset since last DHCSR read</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>At least one reset since last DHCSR read</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>S_RETIRE_ST</name>
                    <description>Set to 1 every time the processor retires one or more instructions</description>
                    <bitRange>[24:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No instruction retired since last DHCSR read</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>At least one instruction retired since last DHCSR read</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>S_LOCKUP</name>
                    <description>Indicates whether the processor is locked up because of an unrecoverable exception</description>
                    <bitRange>[19:19]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not locked up</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Locked up</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>S_SLEEP</name>
                    <description>Indicates whether the processor is sleeping</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not sleeping</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Sleeping</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>S_HALT</name>
                    <description>Indicates whether the processor is in Debug state</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>In Non-debug state</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>In Debug state</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>S_REGRDY</name>
                    <description>A handshake flag for transfers through the DCRDR</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>There has been a write to the DCRDR, but the transfer is not complete</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>The transfer to or from the DCRDR is complete</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>C_SNAPSTALL</name>
                    <description>Allow imprecise entry to Debug state</description>
                    <bitRange>[5:5]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No action</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Allow imprecise entry to Debug state, for example by forcing any stalled load or store instruction to complete</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>C_MASKINTS</name>
                    <description>When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Do not mask</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Mask PendSV, SysTick and external configurable interrupts</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>C_STEP</name>
                    <description>Processor step bit</description>
                    <bitRange>[2:2]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No effect</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Single step enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>C_HALT</name>
                    <description>Processor halt bit</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Causes the processor to leave Debug state, if in Debug state</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halt the processor</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>C_DEBUGEN</name>
                    <description>Halting debug enable bit</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Debug Core Register Selector Register</name>
                <displayName>DCRSR</displayName>
                <description>provides debug access to the ARM core registers, special-purpose registers, and Floating-point extension regi</description>
                <addressOffset>0x4</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>REGWnR</name>
                    <description>Specifies the access type for the transfer</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Read</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Write</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>REGSEL</name>
                    <description>Specifies the ARM core register, special-purpose register, or Floating-point extension register, to transfer</description>
                    <bitRange>[6:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>The current SP</description>
                        <value>13</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>LR</description>
                        <value>14</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>DebugReturnAddress</description>
                        <value>15</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>xPSR</description>
                        <value>16</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Main stack pointer, MSP</description>
                        <value>17</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Process stack pointer, PSP</description>
                        <value>18</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Control, Faultmask, Basepri and Primask</description>
                        <value>20</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Floating-point Status and Control Register, FPSCR</description>
                        <value>33</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Debug Core Register Data Register</name>
                <displayName>DCRDR</displayName>
                <description>provides debug access to the ARM core registers, special-purpose registers, and Floating-point extensio</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>DBGTMP</name>
                    <description>Data temporary cache, for reading and writing the ARM core registers, special-purpose registers, and Floating-point extension registers</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Debug Exception and Monitor Control Register</name>
                <displayName>DEMCR</displayName>
                <description>Manages vector catch behavior and DebugMonitor handling when debugging</description>
                <addressOffset>0xC</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>TRCENA</name>
                    <description>Global enable for all DWT and ITM features</description>
                    <bitRange>[24:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>DWT and ITM units disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>DWT and ITM units enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MON_REQ</name>
                    <description>DebugMonitor semaphore bit</description>
                    <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                    <name>MON_STEP</name>
                    <description>When MON_EN is set to 0, this feature is disabled and the processor ignores MON_STEP</description>
                    <bitRange>[18:18]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Do not step the processor</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Step the processor</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MON_PEND</name>
                    <description>Sets or clears the pending state of the DebugMonitor exception</description>
                    <bitRange>[17:17]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Clear the status of the DebugMonitor exception to not pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Set the status of the DebugMonitor exception to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MON_EN</name>
                    <description>Enable the DebugMonitor exception</description>
                    <bitRange>[16:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>DebugMonitor exception disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>DebugMonitor exception enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_HARDERR</name>
                    <description>Enable halting debug trap on a HardFault exception</description>
                    <bitRange>[10:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_INTERR</name>
                    <description>Enable halting debug trap on a fault occurring during exception entry or exception return</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_BUSERR</name>
                    <description>Enable halting debug trap on a BusFault exception</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_STATERR</name>
                    <description>Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception</description>
                    <bitRange>[7:7]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_CHKERR</name>
                    <description>Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error</description>
                    <bitRange>[6:6]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_NOCPERR</name>
                    <description>Enable halting debug trap on a UsageFault caused by an access to a Coprocessor</description>
                    <bitRange>[5:5]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_MMERR</name>
                    <description>Enable halting debug trap on a MemManage exception</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Halting debug trap disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Halting debug trap enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>VC_CORERESET</name>
                    <description>Enable Reset Vector Catch</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Reset Vector Catch disabled</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Reset Vector Catch enabled</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
