ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>SIG</name>
            <description>Software Interrupt Generation</description>
            <groupName></groupName>
            <baseAddress>0xE000EF00</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x4</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Software Triggered Interrupt Register</name>
                <displayName>STIR</displayName>
                <description>Provides a mechanism for software to generate an interrupt</description>
                <addressOffset>0x0</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>INTID</name>
                    <description>Indicates the interrupt to be triggered</description>
                    <bitRange>[8:0]</bitRange>
                  </field>
                </fields>
              </register>
            </registers>
          </peripheral>
          <peripheral>
            <name>FP</name>
            <description>Floating-Point Extension</description>
            <groupName></groupName>
            <baseAddress>0xE000EF34</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x18</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Floating Point Context Control Register</name>
                <displayName>FPCCR</displayName>
                <description>Holds control data for the Floating Point Unit</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>ASPEN</name>
                    <description>When this bit is set to 1, execution of a floating-point instruction sets the CONTROL</description>
                    <bitRange>[31:31]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Executing an FP instruction has no effect on CONTROL.FPCA</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Executing an FP instruction sets CONTROL.FPCA to 1</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LSPEN</name>
                    <description>Enables lazy context save of FP state</description>
                    <bitRange>[30:30]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Disable automatic lazy context save</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Enable automatic lazy context save</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MONRDY</name>
                    <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the DebugMonitor exception to pending</description>
                    <bitRange>[8:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not able to set the DebugMonitor exception to pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Able to set the DebugMonitor exception to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BFRDY</name>
                    <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the BusFault exception to pending</description>
                    <bitRange>[6:6]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not able to set the BusFault exception to pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Able to set the BusFault exception to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MMRDY</name>
                    <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the MemManage exception to pending</description>
                    <bitRange>[5:5]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not able to set the MemManage exception to pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Able to set the MemManage exception to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>HFRDY</name>
                    <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the HardFault exception to pending</description>
                    <bitRange>[4:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not able to set the HardFault exception to pending</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Able to set the HardFault exception to pending</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>THREAD</name>
                    <description>Indicates the processor mode when it allocated the FP stack frame</description>
                    <bitRange>[3:3]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Handler mode</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Thread mode</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>USER</name>
                    <description>Indicates the privilege level of the software executing when the processor allocated the FP stack frame</description>
                    <bitRange>[1:1]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Privileged</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Unprivileged</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LSPACT</name>
                    <description>Indicates whether Lazy preservation of the FP state is active</description>
                    <bitRange>[0:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Lazy state preservation is not active</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Lazy state preservation is active</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Floating Point Context Address Register</name>
                <displayName>FPCAR</displayName>
                <description>Holds the location of the unpopulated floating-point register space allocated on an exception stack frame</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
              </register>
              <register>
                <name>Floating Point Default Status Control Register</name>
                <displayName>FPDSCR</displayName>
                <description>Holds the default values for the floating-point status control data that the processor assigns to the FPSCR when it creates a new floating-point context</description>
                <addressOffset>0x8</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>AHP</name>
                    <description>Default value for FPSCR.AHP</description>
                    <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                    <name>DN</name>
                    <description>Default value for FPSCR.DN</description>
                    <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                    <name>FZ</name>
                    <description>Default value for FPSCR.FZ</description>
                    <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                    <name>RMode</name>
                    <description>Default value for FPSCR.RMode</description>
                    <bitRange>[23:22]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Media and FP Feature Register 0</name>
                <displayName>MVFR0</displayName>
                <description>Describes the features provided by the Floating-point extension</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>FP rounding modes</name>
                    <description>Indicates the rounding modes supported by the FP floating-point hardware</description>
                    <bitRange>[31:28]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>All rounding modes supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Short vectors</name>
                    <description>Indicates the hardware support for FP short vectors</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported in ARMv7-M</description>
                        <value>0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Square root</name>
                    <description>Indicates the hardware support for FP square root operations</description>
                    <bitRange>[23:20]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Divide</name>
                    <description>Indicates the hardware support for FP divide operations</description>
                    <bitRange>[19:16]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FP exception trapping</name>
                    <description>Indicates whether the FP hardware implementation supports exception trapping</description>
                    <bitRange>[15:12]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported in ARMv7-M</description>
                        <value>0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Double-precision</name>
                    <description>Indicates the hardware support for FP double-precision operations</description>
                    <bitRange>[11:8]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>Single-precision</name>
                    <description>Indicates the hardware support for FP single-precision operations</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>A_SIMD registers</name>
                    <description>Indicates the size of the FP register bank</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported, 16 x 64-bit registers</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Media and FP Feature Register 1</name>
                <displayName>MVFR1</displayName>
                <description>Describes the features provided by the Floating-point extension</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>FP fused MAC</name>
                    <description>Indicates whether the FP supports fused multiply accumulate operations</description>
                    <bitRange>[31:28]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FP HPFP</name>
                    <description>Floating Point Half-Precision and double-precision</description>
                    <bitRange>[27:24]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supports conversion between half-precision and single precision</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>As for 0b0001, and also supports conversion between half-precision and double-precision</description>
                        <value>2</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>D_NaN mode</name>
                    <description>Indicates whether the FP hardware implementation supports only the Default NaN mode</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Hardware supports propagation of NaN values</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FtZ mode</name>
                    <description>Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation</description>
                    <bitRange>[3:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Hardware supports full denormalized number arithmetic</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Media and FP Feature Register 2</name>
                <displayName>MVFR2</displayName>
                <description>Describes the features provided by the floating-point extension</description>
                <addressOffset>0x14</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>VFP_Misc</name>
                    <description>Indicates the hardware support for FP miscellaneous features</description>
                    <bitRange>[7:4]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>No support for miscellaneous features</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Support for floating-point selection, floating-point conversion to integer with direct rounding modes, floating-point round to i</description>
                        <value>4</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
