ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>CMO</name>
            <description>Cache Maintenance Operations</description>
            <groupName></groupName>
            <baseAddress>0xE000EF50</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x2C</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Instruction Cache Invalidate All to PoU</name>
                <displayName>ICIALLU</displayName>
                <description>Invalidate all instruction caches to PoU</description>
                <addressOffset>0x0</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>Ignored</name>
                    <description>The value written to this field is ignored. Ignored</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Instruction Cache line Invalidate by Address to PoU</name>
                <displayName>ICIMVAU</displayName>
                <description>Invalidate instruction cache line by address to PoU</description>
                <addressOffset>0x8</addressOffset>
                <access>write-only</access>
              </register>
              <register>
                <name>Data Cache line Invalidate by Address to PoC</name>
                <displayName>DCIMVAC</displayName>
                <description>Invalidate data or unified cache line by address to PoC</description>
                <addressOffset>0xC</addressOffset>
                <access>write-only</access>
              </register>
              <register>
                <name>Data Cache line Invalidate by Set/Way</name>
                <displayName>DCISW</displayName>
                <description>Invalidate data or unified cache line by set/way</description>
                <addressOffset>0x10</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>SetWay</name>
                    <description>Cache set/way. Contains two fields: Way, bits[31:32-A], the number of the way to operate on</description>
                    <bitRange>[31:4]</bitRange>
                  </field>
                  <field>
                    <name>Level</name>
                    <description>Cache level. Cache level to operate on, minus 1</description>
                    <bitRange>[3:1]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Data Cache line Clean by address to PoU</name>
                <displayName>DCCMVAU</displayName>
                <description>Clean data or unified cache line by address to PoU</description>
                <addressOffset>0x14</addressOffset>
                <access>write-only</access>
              </register>
              <register>
                <name>Data Cache line Clean by Address to PoC</name>
                <displayName>DCCMVAC</displayName>
                <description>Clean data or unified cache line by address to PoC</description>
                <addressOffset>0x18</addressOffset>
                <access>write-only</access>
              </register>
              <register>
                <name>Data Cache Clean line by Set/Way</name>
                <displayName>DCCSW</displayName>
                <description>Clean data or unified cache line by set/way</description>
                <addressOffset>0x1C</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>SetWay</name>
                    <description>Cache set/way. Contains two fields: Way, bits [31:32-A], the number of the way to operate on</description>
                    <bitRange>[31:4]</bitRange>
                  </field>
                  <field>
                    <name>Level</name>
                    <description>Cache level. Cache level to operate on, minus 1</description>
                    <bitRange>[3:1]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Data Cache line Clean and Invalidate by Address to PoC</name>
                <displayName>DCCIMVAC</displayName>
                <description>Clean and invalidate data or unified cache line by address to PoC</description>
                <addressOffset>0x20</addressOffset>
                <access>write-only</access>
              </register>
              <register>
                <name>Data Cache line Clean and Invalidate by Set/Way</name>
                <displayName>DCCISW</displayName>
                <description>Clean and invalidate data or unified cache line by set/way</description>
                <addressOffset>0x24</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>SetWay</name>
                    <description>Cache set/way. Contains two fields: Way, bits[31:32-A], the number of the way to operate on</description>
                    <bitRange>[31:4]</bitRange>
                  </field>
                  <field>
                    <name>Level</name>
                    <description>Cache level. Cache level to operate on, minus 1</description>
                    <bitRange>[3:1]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Branch Predictor Invalidate All</name>
                <displayName>BPIALL</displayName>
                <description>Invalidate all entries from branch predictors</description>
                <addressOffset>0x28</addressOffset>
                <access>write-only</access>
                <fields>
                  <field>
                    <name>Ignored</name>
                    <description>Ignored. The value written to this field is ignored</description>
                    <bitRange>[31:0]</bitRange>
                  </field>
                </fields>
              </register>
