ckormanyos/real-time-cpp/ref_app/target/micros/stm32f446/_debug/Cortex-M4F.svd
            </registers>
          </peripheral>
          <peripheral>
            <name>TPIU</name>
            <description>Trace Port Interface Unit</description>
            <groupName></groupName>
            <baseAddress>0xE0040000</baseAddress>
            <addressBlock>
              <offset>0x0</offset>
              <size>0x1000</size>
              <usage>registers</usage>
            </addressBlock>
            <registers>
              <register>
                <name>Supported Parallel Port Sizes Register</name>
                <displayName>TPIU_SSPSR</displayName>
                <description>Indicates the supported parallel trace port sizes</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>SWIDTH[31:0]</name>
                    <description>SWIDTH[N] represents a trace port width of (N+1)</description>
                    <bitRange>[31:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Width (N+1) not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Width (N+1) supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Current Parallel Port Size Register</name>
                <displayName>TPIU_CSPSR</displayName>
                <description>Defines the width of the current parallel trace port</description>
                <addressOffset>0x4</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>CWIDTH[31:0]</name>
                    <description>CWIDTH[N] represents a trace port width of (N+1)</description>
                    <bitRange>[31:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Width (N+1) is not the current trace port width</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Width (N+1) is the current trace port width</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>Asynchronous Clock Prescaler Register</name>
                <displayName>TPIU_ACPR</displayName>
                <description>Defines a prescaler value for the baud rate of the Serial Wire Output (SWO)</description>
                <addressOffset>0x10</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>SWOSCALER</name>
                    <description>SWO baud rate prescaler value</description>
                    <bitRange>[15:0]</bitRange>
                  </field>
                </fields>
              </register>
              <register>
                <name>Selected Pin Protocol Register</name>
                <displayName>TPIU_SPPR</displayName>
                <description>Selects the protocol used for trace output</description>
                <addressOffset>0xF0</addressOffset>
                <access>read-write</access>
                <fields>
                  <field>
                    <name>TXMODE</name>
                    <description>Specifies the protocol for trace output from the TPIU</description>
                    <bitRange>[1:0]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Parallel trace port mode</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Asynchronous SWO, using Manchester encoding</description>
                        <value>1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Asynchronous SWO, using NRZ encoding</description>
                        <value>10</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>TPIU Type register</name>
                <displayName>TPIU_TYPE</displayName>
                <description>Defines the SWO options supported by the TPIU</description>
                <addressOffset>0xF00</addressOffset>
                <access>read-only</access>
                <fields>
                  <field>
                    <name>NRZVALID</name>
                    <description>Indicates support for SWO using UART/NRZ encoding</description>
                    <bitRange>[11:11]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>MANCVALID</name>
                    <description>Indicates support for SWO using Manchester encoding</description>
                    <bitRange>[10:10]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>PTINVALID</name>
                    <description>Indicates support for parallel trace port operation</description>
                    <bitRange>[9:9]</bitRange>
                    <enumeratedValues>
                      <enumeratedValue>
                        <description>Supported</description>
                        <value>0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <description>Not supported</description>
                        <value>1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>FIFOSZ</name>
                    <description>Indicates the minimum implemented size of the TPIU output FIFO for trace data</description>
                    <bitRange>[8:6]</bitRange>
                  </field>
                </fields>
              </register>
            </registers>
          </peripheral>
        </peripherals>
      </group>
    </groups>
  </cpu>
</device>